app/views/posts/index.html.erb

SELECT COUNT(*) FROM "comments" WHERE "comments"."post_id" = 32
---
    <td class="post-category"><%= category.category_name %></td>
    <td>(<%= post.comments.size %>)</td>