app/views/posts/show.html.erb

SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = 31
---
<ul>
<% comments = @post.comments.select{|comment| comment.id != nil} %>