app/controllers/comments_controller.rb

SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", "31"]]
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = 32
INSERT INTO "comments" ("body", "commenter", "created_at", "post_id", "updated_at") VALUES (?, ?, ?, ?, ?)  [["body", "testeste"], ["commenter", "rtest"], ["created_at", Sun, 02 Jun 2013 05:41:34 UTC +00:00], ["post_id", 31], ["updated_at", Sun, 02 Jun 2013 05:41:34 UTC +00:00]]
---
def create
  @post = Post.find(params[:post_id])
  @comment = Post.find(params[:post_id]).comments.new(params[:comment])
  if @comment.save