app/controllers/posts_controller.rb

SELECT "users".* FROM "users"
---
  def load_users
    @users = []
    User.all.each do |user|

SELECT "posts"."created_at" FROM "posts" WHERE "posts"."posts" IS NULL
SELECT "posts".* FROM "posts" ORDER BY created_at DESC LIMIT 20 OFFSET 0
SELECT COUNT(*) FROM "posts"
---
  def index
    @posts = Post.all(:order => "post_date DESC")
    @posts = Post.page(params[:page])

SELECT "categories".* FROM "categories"
---
  def new
  	@post = Post.new

    @categories = Category.all

INSERT INTO "posts" ("category_id", "content", "created_at", "title", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?)  [["category_id", 3], ["content", "testuser"], ["created_at", Fri, 05 Jul 2013 18:07:51 UTC +00:00], ["title", "testq"], ["updated_at", Fri, 05 Jul 2013 18:07:51 UTC +00:00], ["user_id", "3"]]
---
  def create
  	@post = Post.new(params[:post])
  	if @post.save

SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", "7"]]
UPDATE "posts" SET "updated_at" = '2013-05-28 14:09:09.567848', "content" = '52352' WHERE "posts"."id" = 7
---
  def update
  	@post = Post.find(params[:id])
  	if @post.update_attributes(params[:post])